src/toir_cf/src/Catalogs/торо_ИдентификаторыТехКарт/торо_ИдентификаторыТехКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ИдентификаторыТехКарт</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.торо_СтатусыНормативныхРемонтовИТехКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>проф_КодТехнологическойКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/toir_cf/src/InformationRegisters/торо_ВерсииТехКарт/торо_ВерсииТехКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ВерсииТехКарт</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ТехКарта</name>
    <type>
      <types>CatalogRef.торо_ТехКарты</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторТехКарты</name>
    <type>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/Catalogs/торо_ТехКарты/торо_ТехКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ТехКарты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НормаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержитОпасныеОперации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержитРаботыПовышеннойОпасности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнениеРемонтаТребуетОстановаОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПростоя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПростоя</name>
    <type>
      <types>CatalogRef.торо_ВидыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>НормаВремениТекст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПростояТекст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаПродолжительности</name>
    <type>
      <types>EnumRef.торо_СпособыРасчетаПродолжительности</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданаАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокОпераций</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГраницаЛев</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГраницаПрав</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НормаВремениВСекундах</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособВыполнения</name>
      <type>
        <types>EnumRef.СпособыСтроительства</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID_ПараллельнойОперации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатериальныеЗатраты</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>EnumRef.ГрадацииКачества</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНаЕдиницу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковокНаЕдиницу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТрудовыеЗатраты</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботы</name>
      <comment>Время работы персонала данной квалификации</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>CatalogRef.торо_КвалификацииРемонтногоПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество работников данной квалификации необходимое для выполнения тех.операции</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботыНаЕдиницу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнструментыИТехника</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Инструмент</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботы</name>
      <comment>Время работы персонала данной квалификации</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботыНаЕдиницу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИзмеряемыеПоказатели</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОказываемыеУслуги</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МерыБезопасности</name>
    <attributes>
      <name>МераБезопасности</name>
      <type>
        <types>CatalogRef.торо_МерыБезопасности</types>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/toir_cf/src/Catalogs/торо_ИдентификаторыТехКарт/Forms/ФормаВыбора/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МультиязычностьСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
	Если ЗначениеЗаполнено(Параметры.ДатаОтбора) Тогда 
		ДатаОтбора = Параметры.ДатаОтбора;
		Список.ТекстЗапроса = "ВЫБРАТЬ
		                       |	торо_ВерсииТехКартСрезПоследних.ИдентификаторТехКарты КАК ИдентификаторТехКарты,
		                       |	торо_ВерсииТехКартСрезПоследних.ТехКарта КАК ТехКарта
		                       |ПОМЕСТИТЬ ВерсииНаДату
		                       |ИЗ
		                       |	РегистрСведений.торо_ВерсииТехКарт.СрезПоследних(&ДатаОтбора, ) КАК торо_ВерсииТехКартСрезПоследних
		                       |;
		                       |
		                       |////////////////////////////////////////////////////////////////////////////////
		                       |ВЫБРАТЬ
		                       |	ВерсииНаДату.ИдентификаторТехКарты КАК ИдентификаторТехКарты,
		                       |	ВерсииНаДату.ТехКарта КАК ТехКарта
		                       |ПОМЕСТИТЬ АктуальныеТКНаДату
		                       |ИЗ
		                       |	ВерсииНаДату КАК ВерсииНаДату
		                       |
		                       |ОБЪЕДИНИТЬ ВСЕ
		                       |
		                       |ВЫБРАТЬ
		                       |	ВерсииСтаршеДатыОтбора.ИдентификаторТехКарты,
		                       |	ВерсииСтаршеДатыОтбора.ТехКарта
		                       |ИЗ
		                       |	РегистрСведений.торо_ВерсииТехКарт.СрезПервых(
		                       |			&ДатаОтбора,
		                       |			НЕ ИдентификаторТехКарты В
		                       |					(ВЫБРАТЬ
		                       |						ВерсииНаДату.ИдентификаторТехКарты
		                       |					ИЗ
		                       |						ВерсииНаДату)) КАК ВерсииСтаршеДатыОтбора
		                       |;
		                       |
		                       |////////////////////////////////////////////////////////////////////////////////
		                       |ВЫБРАТЬ
		                       |	Справочникторо_ИдентификаторыТехКарт.Ссылка КАК Ссылка,
		                       |	Справочникторо_ИдентификаторыТехКарт.ПометкаУдаления КАК ПометкаУдаления,
		                       |	Справочникторо_ИдентификаторыТехКарт.Родитель КАК Родитель,
		                       |	Справочникторо_ИдентификаторыТехКарт.ЭтоГруппа КАК ЭтоГруппа,
		                       |	Справочникторо_ИдентификаторыТехКарт.Код КАК Код,
		                       |	Справочникторо_ИдентификаторыТехКарт.Наименование КАК Наименование,
		                       |	Справочникторо_ИдентификаторыТехКарт.Предопределенный КАК Предопределенный,
		                       |	Справочникторо_ИдентификаторыТехКарт.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
		                       |	Справочникторо_ИдентификаторыТехКарт.Статус КАК Статус,
		                       |	ЕСТЬNULL(АктуальныеТК.ТехКарта, ЗНАЧЕНИЕ(Справочник.торо_ТехКарты.ПустаяСсылка)) КАК ТехКарта,
		                       |	ЕСТЬNULL(АктуальныеТК.ТехКарта.СодержитОпасныеОперации, ЛОЖЬ) КАК СодержитОпасныеОперации,
		                       |	ЕСТЬNULL(АктуальныеТК.ТехКарта.СодержитРаботыПовышеннойОпасности, ЛОЖЬ) КАК СодержитРаботыПовышеннойОпасности,
		                       |	ЕСТЬNULL(АктуальныеТК.ТехКарта.НормаВремениТекст, """") КАК НормаВремени,
		                       |	ЕСТЬNULL(АктуальныеТК.ТехКарта.Комментарий, """") КАК Комментарий,
		                       |	ЕСТЬNULL(АктуальныеТК.ТехКарта.ДатаПринятия, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаПринятия,
		                       |	ЕСТЬNULL(АктуальныеТК.ТехКарта.ВыполнениеРемонтаТребуетОстановаОборудования, ЛОЖЬ) КАК ВыполнениеРемонтаТребуетОстановаОборудования,
		                       |	ЕСТЬNULL(АктуальныеТК.ТехКарта.ВремяПростояТекст, """") КАК ВремяПростоя,
		                       |	ЕСТЬNULL(АктуальныеТК.ТехКарта.ВидПростоя, ЗНАЧЕНИЕ(Справочник.торо_ВидыЭксплуатации.ПустаяСсылка)) КАК ВидПростоя
		                       |ИЗ
		                       |	Справочник.торо_ИдентификаторыТехКарт КАК Справочникторо_ИдентификаторыТехКарт
		                       |		ЛЕВОЕ СОЕДИНЕНИЕ АктуальныеТКНаДату КАК АктуальныеТК
		                       |		ПО (АктуальныеТК.ИдентификаторТехКарты = Справочникторо_ИдентификаторыТехКарт.Ссылка)";
		Список.Параметры.УстановитьЗначениеПараметра("ДатаОтбора", ДатаОтбора);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СоздатьТехКарту(Команда)
	
	ТекущиеДанные =  Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ОткрытьФорму("Справочник.торо_ИдентификаторыТехКарт.Форма.ФормаГруппы", Новый Структура("Родитель", ПредопределенноеЗначение("Справочник.торо_ИдентификаторыТехКарт.ПустаяСсылка")), ЭтаФорма);
		Возврат;
	КонецЕсли;
	
	Родитель = ?(ТекущиеДанные.ЭтоГруппа, ТекущиеДанные.Ссылка, ТекущиеДанные.Родитель);
	
	Форма = ОткрытьФорму("Справочник.торо_ИдентификаторыТехКарт.Форма.ФормаЭлемента", Новый Структура("Родитель", Родитель), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьГруппу(Команда)

	ТекущиеДанные =  Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ОткрытьФорму("Справочник.торо_ИдентификаторыТехКарт.Форма.ФормаГруппы", Новый Структура("ЭтоГруппа, Родитель", Истина, ПредопределенноеЗначение("Справочник.торо_ИдентификаторыТехКарт.ПустаяСсылка")), ЭтаФорма);
		Возврат;
	КонецЕсли;
	
	Родитель = ?(ТекущиеДанные.ЭтоГруппа, ТекущиеДанные.Ссылка, ТекущиеДанные.Родитель);
	
	Форма = ОткрытьФорму("Справочник.торо_ИдентификаторыТехКарт.Форма.ФормаГруппы", Новый Структура("ЭтоГруппа, Родитель", Истина, Родитель), ЭтаФорма);		
	
КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)
	
	ТекДанные = Элементы.Список.ТекущиеДанные;	
	Если НЕ ТекДанные = Неопределено Тогда
		Если ТекДанные.ЭтоГруппа Тогда
			ПоказатьЗначение(Неопределено,ТекДанные.Ссылка);
		Иначе
			ПоказатьЗначение(Неопределено,ТекДанные.Ссылка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ДатаОтбора) Тогда 
		Если ТипЗнч(Значение) = Тип("Массив") И Значение.Количество() > 1 Тогда 
			ПроверитьДатуНаСервере(Значение, СтандартнаяОбработка);
		ИначеЕсли Элемент.ТекущиеДанные.ДатаПринятия > ДатаОтбора Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Дата принятия карты «%1» %2 больше %3'"), 
				Элемент.ТекущиеДанные.Наименование, Формат(Элемент.ТекущиеДанные.ДатаПринятия, "ДФ=dd.MM.yyyy"), Формат(ДатаОтбора, "ДФ=dd.MM.yyyy"))); 
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьДатуНаСервере(ВыбранныеСтроки, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_ВерсииТехКартСрезПоследних.ИдентификаторТехКарты КАК ИдентификаторТехКарты,
	               |	торо_ВерсииТехКартСрезПоследних.Период КАК Период
	               |ПОМЕСТИТЬ ВерсииТКНаДату
	               |ИЗ
	               |	РегистрСведений.торо_ВерсииТехКарт.СрезПоследних(&ДатаДокумента, ИдентификаторТехКарты В (&СписокИД)) КАК торо_ВерсииТехКартСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	торо_ВерсииТехКартСрезПервых.ИдентификаторТехКарты КАК ИдентификаторТехКарты,
	               |	торо_ВерсииТехКартСрезПервых.Период КАК Период
	               |ИЗ
	               |	РегистрСведений.торо_ВерсииТехКарт.СрезПервых(
	               |			&ДатаДокумента,
	               |			ИдентификаторТехКарты В (&СписокИД)
	               |				И НЕ ИдентификаторТехКарты В
	               |						(ВЫБРАТЬ
	               |							ВерсииТКНаДату.ИдентификаторТехКарты
	               |						ИЗ
	               |							ВерсииТКНаДату)) КАК торо_ВерсииТехКартСрезПервых
	               |ГДЕ
	               |	торо_ВерсииТехКартСрезПервых.Период > &ДатаДокумента
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВерсииТКНаДату.ИдентификаторТехКарты,
	               |	ВерсииТКНаДату.Период
	               |ИЗ
	               |	ВерсииТКНаДату КАК ВерсииТКНаДату
	               |ГДЕ
	               |	ВерсииТКНаДату.Период > &ДатаДокумента";
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаОтбора);
	Запрос.УстановитьПараметр("СписокИД", ВыбранныеСтроки);
	РезЗапроса = Запрос.Выполнить();
	Если НЕ РезЗапроса.Пустой() Тогда
		Выборка = РезЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл 
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Дата принятия карты «%1» %2 больше %3'"), 
				Выборка.ИдентификаторТехКарты, Формат(Выборка.Период, "ДФ=dd.MM.yyyy"), Формат(ДатаОтбора, "ДФ=dd.MM.yyyy")));
			СтандартнаяОбработка = Ложь;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
